[
    {
        "possibleCombinations": "Aries - Taurus",
        "combinationid": 1,
        "description": "Did an Aries and Taurus match just enter the chat? Cue: passion and intimacy. Aries are total bosses, fearless, and always down to make moves. Meanwhile, Tauruses are sensual beings, earthy, and loyal AF. They're all about slow-burning, deliberate connections.\n\nDespite being different, these two signs have mad chemistry, and when they're together, it's explosive. This connection is more than just a physical one. Sure, you’re bound to feel sparks flying, but that’s in part due to the emotional depths these two are willing to take each other to. Aries pushes Taurus to take risks and go after what they want, while Taurus brings stability and sensuality to Aries' life.\n\nAnd speaking of hot connections, have you seen Lance Bass and Michael Turchin? Total relationship goals! Lance, the ultimate confident and adventurous Aries, is all about taking charge, and Michael, the sultry and practical Taurus, keeps him grounded. They're all about trust, mutual respect, and living life to the fullest. Slay away, babies!\n",
        "overallscore": 60,
        "careerscore": 55,
        "intimatescore": 65,
        "mindsetscore": 60,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Aries - Gemini",
        "combinationid": 2,
        "description": "An Aries and Gemini pairing is like looking at two sides of the same steamy coin. Both are known for their almost-elusive independence and magnetic, adventurous natures — always on the lookout for something exciting and new. Mars, the planet of action and drive, rules Aries, while Mercury, the planet of communication and intelligence, rules Geminis. This creates a foundation for an incredibly energetic partnership where both parties have a special way with words and love. \n\nNow, when you mix two star signs notorious for the heat they bring you’re bound to get a little tension. Aries are passionate and intense — they’re fire signs, after all. Geminis, on the other hand, are air signs — which means they’re more aloof and stuck in their own heads. This can lead Aries to come off as aggressive and impatient, and Geminis as indecisive and a little too fiery. \n\nDespite these potential obstacles, an Aries-Gemini pairing can be explosive and thrilling. They are both spontaneous and love to try new things. There will never be a boring moment up in this match. Their relationship can be compared to the classing song, “Ain’t No Mountain High Enough,” by Marvin Gaye and Tammi Terrell. Aries, like the powerful voice of Gaye, are gonna be passionate and energetic, while their Gemini counterpart, the harmonies of Terrell, bring complexity, depth, and a little something extra to the mix. \n",
        "overallscore": 80,
        "careerscore": 75,
        "intimatescore": 85,
        "mindsetscore": 70,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Aries - Cancer",
        "combinationid": 3,
        "description": "Let's talk about Aries and Cancer star sign partners, babes! They may share some similarities, but they're worlds apart. Aries are bold, outgoing, and thrive on challenges, while Cancerians tend to be more introverted, emotional, and cautious. Aries' fiery energy can sometimes clash with Cancer's sensitive nature, but when they’re in sync and able to find a balance, they make an unstoppable team.\n\nAries and Cancer value loyalty and commitment, which can create a solid foundation for a partnership. However, Aries need to be mindful of Cancers' feelings and avoid being too fiery or confrontational. In turn, Cancers need to be ready and willing to communicate openly and not let their insecurities ruin things. \n\nI know this can sound scary, but don’t shy away from this match just yet! I mean let’s just look at Alice and Dana from The L-Word. Alice embodies the lively and adventurous spirit of Aries, while Dana represents Cancer's emotional sensitivity. They're both queer, modern icons who show us how powerful this dynamic can be. \n",
        "overallscore": 65,
        "careerscore": 70,
        "intimatescore": 50,
        "mindsetscore": 60,
        "interestsscore": 65
    },
    {
        "possibleCombinations": "Aries - Leo",
        "combinationid": 4,
        "description": "This match! It’s trying to kill me! An Aries and Leo pairing is all about love, intensity, and devotion. Aries are all about passion, courage, and spontaneity, and Leos are all about warmth, generosity, and, let’s be real, a little bit of drama. Together, they're a dynamic duo that can light up any room they walk into.\n\nThe similarities between Aries and Leo are uncanny. They're both confident, enjoy the spotlight, and love to express themselves in all kinds of creative and passionate manners. That being said, we’ve all heard too much of a good thing can be a bad thing… Here’s a little something you’ll want to keep in mind as you dive headfirst into the flame of love (or lust): Aries can be impulsive and quick to act, while Leo is more thoughtful and calculated. If you manage to find a good balance and help keep each other in check — that’s where the real magic happens, with Aries pushing Leo to take risks and Leo grounding Aries when they're about to make a wild move. \n\nIf Aries and Leo were on The L Word, they would be Bette and Tina, no doubt about it! Bette is a total boss, ambitious and unafraid to take risks, just like Aries. Meanwhile, Tina is nurturing, thoughtful, and full of heart, just like Leo. Together, they're a queer and modern duo that we’re unable to get enough of.\n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Aries - Virgo",
        "combinationid": 5,
        "description": "Alright, babe, let’s get into it: the ever-intriguing Aries and Virgo match! Now, despite these two powerful star signs often being perceived as being quite opposite… that’s not entirely true. As earth and fire signs, both share a passion for adventure, intelligence, and loyalty. That’s a pretty solid foundation for a relationship if you ask me! \n\nSo, where did people get this idea these two signs were bound to clash? Well, in the method to their madness. Let me explain: Aries and Virgos approach life pretty differently. Virgos are meticulous, practical, and detail-oriented, while Aries are… a bit more loose, impulsive, and free-spirited. While these differences can, at times, lead to conflict — they can also be the thing that encourages them to try new things, and broaden their horizons! \n\nIn a partnership, Virgos bring stability, organization, and a critical eye to the table, while Aries bring spontaneity, courage, and excitement. This means that Virgos can help ground Aries and guide them toward their goals, while Aries can push Virgos out of their comfort zones and encourage them to take risks. \n\nImagine an odd couple like Big Boo and Pennsatucky from Orange is the New Black — different backgrounds, but supportive of each other nonetheless. \n",
        "overallscore": 75,
        "careerscore": 80,
        "intimatescore": 60,
        "mindsetscore": 70,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Aries - Libra",
        "combinationid": 6,
        "description": "Hey, lovebird, it’s time to get astrologizing. It’s safe to say that when it comes down to a Libra and Aries match — things can feel a little complicated. After all, Libras are all about balance, harmony, and fairness while Aries are sizzling, daring, and always ready for some friendly pot stirring. However, despite their differences, these two star signs actually do have quite a lot in common! Both are natural-born leaders, social butterflies, enjoy the limelight, and love spending time with their friends and fam. \n\nWhen boo’d up, these two signs can truly help each other be the best version of themselves! For instance, Libras often help Aries find inner grounding and balance, and Aries tend to bring a little extra excitement and thrill into a Libra’s life. \n\nFor a first queer date, why not go for something fun and campy? Go for a drag show for a fun way to get loose and show your true colors. Or, if you'd rather do something more low-key, head to a cozy coffee shop and trade some music or poetry. Either way, dress to impress and be your most fabulous self!\n",
        "overallscore": 60,
        "careerscore": 75,
        "intimatescore": 65,
        "mindsetscore": 50,
        "interestsscore": 50
    },
    {
        "possibleCombinations": "Aries - Scorpio",
        "combinationid": 7,
        "description": "Buckle up, babes, because a Scorpio and Aries match is a hot one. Literally. These two fire signs tend to be magnetically drawn toward each other and share an electric passion for life and the little things that give it meaning. Both star signs are fierce, determined, and won’t hold back when it comes to pursuing their dreams! While Scorpios tend to be more enigmatic and secretive, and Aries are usually more brazen and outgoing — they do tend to bring out the best, and the fires, in one another. \n\nTheir similarities lie in their daring and zealous nature. They both have a strong need for autonomy and are not afraid to take risks. This can create a thrilling and dynamic partnership, as they push each other to develop and discover new possibilities. However, their differences can also cause some conflicts, as Scorpio can be more possessive and envious, while Aries values their independence. Hey, nobody said being passionate to the core was easy! \n\nFor a first queer date, why not try something daring like a drag show or a leather bar? Embrace the stereotypes and have some daring fun with the playful and sensual dynamics of this unbeatable duo. \n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 80,
        "mindsetscore": 75,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Aries - Sagittarius",
        "combinationid": 8,
        "description": "This steamy duo tends to create a temperamental yet undeniably exciting match. Aries and Sagittarius are passionate, witty, independent, and incredibly ambitious. And while Aries tend to be more impulsive and quick-tempered, Sagittarius tend to be more philosophical and detached — so brace yourself for a few moments of rocky waters while you two get into the groove that works for you and your relationship. \n \nIf Aries and Sagittarius were a queer celebrity couple, they would be none other than the legendary RuPaul and George Takei, who both embody a trailblazing spirit that is unapologetic and inspiring — qualities that Aries and Sagittarius share in abundance. Humble brag, anyone? Together, they would make a powerful and unstoppable duo, inspiring others to follow their dreams and live life to the fullest.\n",
        "overallscore": 80,
        "careerscore": 90,
        "intimatescore": 75,
        "mindsetscore": 90,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Aries - Capricorn",
        "combinationid": 9,
        "description": "Sure, at first glance, this match might seem like an unlikely pairing. But, your honor, my clients are often misrepresented! Their differences actually make for a beautifully vibrant dynamic that can be deeply fulfilling. Aries is a fire sign, full of passion and impulsiveness, while Capricorn is an earth sign, grounded and practical. This combination can create a powerful and successful partnership, with Aries providing the spark that ignites Capricorn's ambition, and Capricorn helping to ground Aries and turn their ideas into a reality. The fascinating connection between these two star signs means they’ll always be exposed to new, and thrilling experiences, and never fail to keep each other on their toes. \n\nBoth of these signs can be very playful and talkative — so what better first date idea than to go to a boardgame café or trivia night at your fav local spot? ",
        "overallscore": 70,
        "careerscore": 80,
        "intimatescore": 60,
        "mindsetscore": 75,
        "interestsscore": 65
    },
    {
        "possibleCombinations": "Aries - Aquarius",
        "combinationid": 10,
        "description": "You know what’s wild? An Aries and Aquarius duo. Though these two star signs can’t get much more different from each other, they still manage to sparkle together. Aries is a fire sign, while Aquarius is an air sign, which means we approach life in very unique ways. Aries is impulsive, passionate, and fiery, while Aquarius is logical, independent, and aloof. But both signs are bold, independent, and free-spirited, so we have plenty of common ground to make a lasting connection. \n\nIn a relationship, Aries brings enthusiasm and fervor, while Aquarius brings emotional excitement and out-of-the-box ideas. They often motivate each other to keep expanding and pushing each other’s perceptions, while still embracing their quirks and respecting each other’s boundaries. It's just like Paula Abdul’s banger, Opposites Attract, “and you know it ain't fiction, just a natural fact. We come together 'cause opposites attract.”\n",
        "overallscore": 80,
        "careerscore": 90,
        "intimatescore": 75,
        "mindsetscore": 85,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Aries - Pisces",
        "combinationid": 11,
        "description": "I’m gonna be real with you: an Aries and Pisces match can be a wild, wild ride. Aries tend to be bold, energetic, and confident, while Pisces are more sensitive, imaginative, and intuitive. Aries are known for their zesty and fiery attitudes, and their need for excitement and thrills, while Pisces prefer to spend their days daydreaming and getting lost in their romantic fantasies. \n\nThat being said, both of these signs have a passion for the world and adventures, like no other. When they come together, they can create an incredibly fulfilling and passionate life together! Aries can help Pisces be more confident and outspoken, and Pisces can help Aries embrace their intuition and sensitivities a little more. \n\nWhile Aries may sometimes feel overwhelmed by Pisces' lack of assertiveness and Pisces may struggle to keep up with Aries' energy — these two signs can also create something incredible together. Like Lady Gaga, Bradley Cooper’s ‘Shallow’ incredible: “I’m off the deep end, let’s just jump in — I’ll never hit the grouuuuund…”\n",
        "overallscore": 70,
        "careerscore": 80,
        "intimatescore": 60,
        "mindsetscore": 75,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Taurus - Gemini",
        "combinationid": 12,
        "description": "Taurus and Gemini are neighbor signs with a whole lot of personality. While they certainly have some differences, these two can complement each other quite charmingly! Sure, Taurus is a homebody who’s known for being down-to-earth, while Geminis have a reputation for being… complex… but both of these signs share a love for intellectually stimulating chats, the beauty of everyday moments, and sensuality. \n\nWhen they’re together, Tauruses can bring a sense of stability, loyalty, and tenderness to their Gemini boo, and Geminis can inspire Tauruses with their curiosity, adaptability, and outgoing nature. With understanding, open-mindedness, and some flexibility, this match can bring out the very best in one another! \n\nImagine a duo like Sophia and Gloria from Orange is the New Black — different personalities, but they work together to create something beautiful. \n",
        "overallscore": 70,
        "careerscore": 60,
        "intimatescore": 80,
        "mindsetscore": 65,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Cancer",
        "combinationid": 13,
        "description": "Alright, babes, I've got great news for you: when Taurus and Cancer come together, it's a love story for the ages! Both signs value stability, loyalty, and security, making them a dream team for a long-lasting partnership. Taurus, as an earth sign, brings practicality, reliability, and sizzling sensuality to the party, while Cancer, as a water sign, injects emotional depth, nurturing, and intuitive vibes. These shared qualities mean they can create a home and family life together that is both rock-solid and filled with joy.\n\nThat being said, Taurus and Cancer do have different perspectives on how they aim to make their dreams come true. Taurus may take the ‘no-nonsense’ approach, while Cancer may use their emotional intelligence and intuition to get through any obstacle. These differences can create a unique balance, as Taurus helps to ground Cancer and Cancer helps Taurus to express their innermost emotions.\n\nThink of Taurus and Cancer as modern-day Bette and Tina from The L Word — both powerful, ambitious, and devotedly devoted to each other.\n",
        "overallscore": 95,
        "careerscore": 85,
        "intimatescore": 90,
        "mindsetscore": 95,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Taurus - Leo",
        "combinationid": 14,
        "description": "Taurus and Leo may seem like different planets in the same universe, but really, they’re more like Saturn and its ring. Two different parts of the same cosmic creation! Both Taurus and Leo are steadfast signs, which means they tend to be determined and always try to follow through with their goals. However… how they choose to get there is a whole different story. \n\nTaurus is an earth sign, reliable and practical, while Leo is a fire sign, full of imagination and passion. Their combined yearning for stability and luxury means they both enjoy the finer things in life and have a penchant for collecting material possessions. In order for this duo to bring out the best in each other, Taurus may need to learn to be more open-minded to Leo's spontaneous nature, while Leo can inspire Taurus to take more risks and embrace change.\n\nIf this queer pairing were a place on Earth, it would be the glorious Amalfi Coast in Italy. Like Taurus, the Amalfi Coast is steadfast, with beautiful natural landscapes. But like Leo, it also has a creative spirit that can be seen in its dynamic culture and bold architecture.\n",
        "overallscore": 75,
        "careerscore": 80,
        "intimatescore": 70,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Virgo",
        "combinationid": 15,
        "description": "Well, well, well! It looks like Taurus and Virgo have found each other in this crazy world of ours. As fellow earth signs, they share a no-nonsense approach to life, which can be both practical and oh-so-sexy. With their strong work ethic and attention to detail, these two star signs could easily dominate the world together, whether that be in the boardroom or the bedroom (that was a lot, but I’m not here to lie to you).\n\nNow, let's not forget that no matter how similar two signs might appear, they still have unique flavors! Taurus is all about the physical pleasures of life, from luxurious massages to good food and wine. Meanwhile, Virgo is more interested in intellectual stimulation, personal growth, and all things sustainable. Together, they create the perfect balance — Taurus provides comfort and stability, while Virgo adds structure, dedication, and growth.\n\nSo, if you’re ready for a first date idea that screams queer excellence, how about this: take a romantic stroll through a park or a whimsical botanical garden. Bring a picnic basket filled with organic wine, locally-sourced cheeses, and homemade jams. As you connect with each other and the earth, your love will surely bloom like the beautiful flowers surrounding you.\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 85,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Libra",
        "combinationid": 16,
        "description": "Alright angel, let's talk Taurus and Libra star sign compatibility. I hope you’re giddy and ready because this is a match made in queer heaven! These two signs are all about beauty, stability, and indulgence in the finer things in life. While Taurus is grounded and practical, Libra is more of a social butterfly and an intellectual.\n\nIn a romantic partnership, these two could balance each other out perfectly. Taurus can help Libra stay focused and grounded, while Libra can bring some much-needed fun and excitement to Taurus's life. Of course, they should watch out for potential conflicts. Taurus's stubbornness could clash with Libra's need for compromise, and Libra's indecisiveness might drive Taurus up the wall.\n\nBut when they come together, they're like the chorus of Lady Gaga and Bradley Cooper's \"Shallow.\" Taurus is all about diving in headfirst, just like the line \"I'm off the deep end, watch as I dive in.\" Meanwhile, Libra is always looking for something new and exciting, just like the line “In all the good times, I find myself longing for change.\" And with these two, love is always in the air!\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Scorpio",
        "combinationid": 17,
        "description": "Taurus and Scorpio are like two pots of gold sitting at the opposite ends of a rainbow. Both are fiercely passionate and loyal, but their approaches to love and life can be wildly different. Taurus is a grounded and practical earth sign, while Scorpio is a deeply emotional and intense water sign. These differences can create fireworks, sparks, and a little bit of tension but, with open mindedness and authenticity, they can also help harmonize and balance each other in a partnership. Taurus can bring stability and a sense of safety to Scorpio's intense feelings, while Scorpio can awaken Taurus to their hidden desires and passions.\n\nThe compatibility score with these two star signs is off the charts. Together, Taurus and Scorpio remind us of glittering Pride parades and fabulous drag shows. Taurus embodies a je ne sais quoi, effortless \"I'm a boss with a little bit of gentle,\" while Scorpio represents a sassy kind off \"I'm a unicorn in a world full of horses\" vibe. This is a match made in queer heaven, and we hope you’re ready to dance to you and your babe’s own tune!\n",
        "overallscore": 70,
        "careerscore": 65,
        "intimatescore": 95,
        "mindsetscore": 60,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Sagittarius",
        "combinationid": 18,
        "description": "It’s time we acknowledge — nay — celebrate how sweet and tender a Taurus and Sagittarius match can be! As earth and fire signs, they share a thirst for adventure, pleasure, and independence. However, their approaches to life are definitely the remixed versions of one another’s. Tauruses are stable, practical, and grounded, while Sagittariuses are wild, philosophical, and freedom-loving. These differences can create some sparks, but with compromise and mutual admiration, they can complement each other like peanut butter and jelly.\n\nIn a partnership, Tauruses bring loyalty, reliability, and sensuality to the table, while Sagittariuses bring humor, optimism, and a sense of adventure. This means that Tauruses can provide a cozy sanctuary for Sagittariuses to recharge and rejuvenate, while Sagittariuses can spice up Tauruses' lives with their impulsive very fun ideas and thrilling escapades. Imagine Abby and Harper from \"Happiest Season\" — they come from different backgrounds and have different needs, but with effort, they can make it work.",
        "overallscore": 65,
        "careerscore": 70,
        "intimatescore": 60,
        "mindsetscore": 70,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Capricorn",
        "combinationid": 19,
        "description": "Alright, babes, I’ve got some pretty great news for you: a Taurus and Capricorn match tends to be rock-solid. Both are earth signs, which means they share a love for the finer things in life, stability, and a more practical approach to problem-solving. While Taurus can be stubborn and focused on pleasure and comfort, Capricorn is more disciplined and focused on achieving success. This means that when in a partnership, Taurus can show Capricorn how to relax and indulge in life's pleasures, while Capricorn can help Taurus stay grounded and focused on their dreams.\n\nIf we were to compare this potential queer power couple to a spot on the queer map, it would be the dazzling and fabulous Castro district in San Francisco. Like Taurus and Capricorn, the Castro values luxury, stability, and practicality, but it's also a place where LGBTQIA+ folks can be themselves and celebrate their love. So, let's raise a rainbow flag to Taurus and Capricorn — sure, they may be different, but they make a perfect match!\n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 70,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Taurus - Aquarius",
        "combinationid": 20,
        "description": "Taurus and Aquarius — a match that's as wild as a unicorn at a rodeo! Sure, they may seem like polar opposites, but that's what makes their relationship so exciting. Tauruses love to indulge in the finer things in life, while Aquarians prefer to break all the rules and do things their own way. \n\nIn a partnership, Tauruses bring stability, comfort, and a sense of grounding to the table, while Aquarians bring their innovative ideas, intellectual prowess, and a love for experimentation. Together, they can create a fusion of pleasure and adventure that's hotter than a drag show in Vegas. Picture Jinkx Monsoon and BenDeLaCreme from RuPaul's Drag Race — two queens who couldn't be more different, but whose dynamic partnership creates magic on stage.\n\nTaurus and Aquarius can create a unique bond that's full of surprises. Their different approaches to life may cause some conflicts, but with open communication and mutual understanding, they can learn from each other and create an unstoppable partnership.\n",
        "overallscore": 70,
        "careerscore": 75,
        "intimatescore": 60,
        "mindsetscore": 80,
        "interestsscore": 65
    },
    {
        "possibleCombinations": "Taurus - Pisces",
        "combinationid": 21,
        "description": "It doesn’t get a whole lot more sensual and fairy dusty than a Taurus and Pisces match. These two daydreaming lovebirds coming together can create the world’s most fantastical, and whimsical love spell. Their differences beautifully complement each other — Taurus is all about stability and practicality, while Pisces is all about free flowing emotions and trusting their intuition. Think of Taurus as the riverbank that Pisces can feel safe to swim in. \n\nIn a partnership, Taurus brings loyalty, sensuality, and a love for comfort to the table, while Pisces brings imagination, creativity, and a touch of magic. Together, they can create a vibrant and dynamic love story that is like the rainbow after the rain. Imagine Mariah Carey and her glittery butterfly, creating a stunning masterpiece together. \n\nOverall, Taurus and Pisces have a high compatibility score, but they may need to work on communication and understanding each other's needs. With a little bit of compromise and a lot of love, they can create a beautiful and harmonious partnership that is both fun and fulfilling.\n",
        "overallscore": 80,
        "careerscore": 70,
        "intimatescore": 90,
        "mindsetscore": 75,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Gemini - Cancer",
        "combinationid": 22,
        "description": "I know what you may be thinking — Gemini and Cancer may seem like an unlikely match at first glance! However, I’ve got some good news: they actually both have a lot to offer each other. Gemini's witty banter and love for variety can spice up Cancer's nurturing and emotional nature, while Cancer's intuition and sensitivity can help ground Gemini's sometimes flighty tendencies. Together, they can create a partnership that is both intellectually stimulating and emotionally fulfilling. Their contrasting personalities work incredibly well, and these two have an ability like no other to capture each other for hours at a time. \n\nIf we were to compare this potential queer couple to a place on Earth, it would be the colorful and eclectic city of New Orleans. Like Gemini and Cancer, New Orleans is a city that values communication, adaptability, and emotion. From the jazz music and street performances to the unique architecture and absolutely amazing food, New Orleans offers a little something for everyone, just like this dynamic duo.\n\n",
        "overallscore": 75,
        "careerscore": 70,
        "intimatescore": 80,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Gemini - Leo",
        "combinationid": 23,
        "description": "If you’re looking for a bold and electric match — look no further than a Gemini and Leo pairing. As air and fire signs, they share a love for adventure, excitement, and creativity. Geminis are like social butterflies, prancing around from one conversation to the next, while Leos are like the queens of the jungle, fierce, confident, and into a bit of extra attention. These differences can lead to some power struggles, but with a little mutual admiration and understanding, they can create a dazzling (and very steamy) partnership.\n\nGeminis bring versatility, quick-wittedness, and mental stimulation, while Leos bring charisma, passion, and a whole lot of heart. This means that Geminis can keep Leos on their toes and provide a fresh perspective, while Leos can provide the direction and leadership to take things to the next level. They make a fierce and fabulous match, both in and out of the bedroom. They're not afraid to try new things and push boundaries, which means they can explore their passions and desires together. So, don't be afraid to let this thing shine — together, you can light up the world!\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Gemini - Virgo",
        "combinationid": 24,
        "description": "Let's spill some astrology tea, shall we? Geminis and Virgos are both fabulous, but in different ways. Gemini is an air sign, always up for some witty banter and exploration, while Virgo is an earth sign, practical, meticulous and clever. Together, they can inspire a cool, and charged relationship that’s a bit too intriguing to not buy into. Enemies-to-lovers plotlines, anyone? \n\nGemini and Virgo folks have a lot in common, such as our love for knowledge, our attention to detail, and our adaptability. But, of course, they differ in their approach to achieving those things. While Gemini likes to explore ideas, Virgo prefers to apply them in tried-and-true ways. But hey, that's what makes it spicy, right?\n\nThis dynamic can make for a stimulating partnership. Gemini can teach Virgo to let loose and have some fun, while Virgo can ground Gemini's flights of fancy. Together, we are like the lyrics of Ariana Grande's \"7 rings.\" Gemini embodies the line \"I see it, I like it, I want it, I got it,\" while Virgo represents the line \"Whoever said money can't solve your problems must not have had enough money to solve 'em.\"\n\nSo let's cheers to all the queer Gemini-Virgo couples out there. May your partnership be full of fun, love, and endless intellectual stimulation. You are a sparkling cocktail and a sophisticated wine all in one, and we love you for it.\n",
        "overallscore": 80,
        "careerscore": 90,
        "intimatescore": 70,
        "mindsetscore": 85,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Gemini - Libra",
        "combinationid": 25,
        "description": "Alright, babe, let me tell you about Gemini and Libra. This duo is a perfect match made in the queerest heaven! Since both are air signs, they share so much in common when it comes to their communication styles, social nature, and intellectual curiosity. They can hang back and chit-chat for hours, and are always down for new experiences and to see things from different perspectives.\n\nBut, let's not forget that they have their differences too! While Gemini can be a little indecisive and all over the place, Libra is more balanced and rational, which helps keep their partner grounded. And of course, Gemini brings the fun and adventurous energy to the relationship, while Libra brings a sense of harmony and balance to keep things chill.\n\nNow, if we were to compare this queer couple to a place on Earth, it would have to be the city that never sleeps, the one and only New York City, baby! Just like Gemini and Libra, New York is a vibrant and diverse place, where ideas are constantly flowing and new experiences are always around the corner. It's the perfect place for these two air signs to thrive and continue their queer journey together. \n",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 95,
        "mindsetscore": 90,
        "interestsscore": 95
    },
    {
        "possibleCombinations": "Gemini - Scorpio",
        "combinationid": 26,
        "description": "Alright, babe, I’m not gonna lie to you — a Gemini and Scorpio pairing isn’t for the lighthearted. But it sure can be rewarding. While these two signs are both intellectually-driven, curious, and emotionally complex, their way of navigating the world around them is absolutely opposite. Geminis are air signs that value independence, variety, and straightforward communication, while Scorpios are water signs that value intensity, loyalty, and clever charm. \n\nWarning labels stated, though, when these two come together — everyone’s bound for a passionate ride. These two mysterious and witty star signs can help each other broaden their horizons, and live amidst a beautifully romantic flame. After all, that's what keeps things interesting, right?\n\nIn a relationship, Geminis bring their witty charm, adaptability, and social skills to the table, while Scorpios bring their passion, mystery, and depth. Geminis can help Scorpios open up and express themselves, while Scorpios can help Geminis delve deeper into their emotions and relationships.\n\nSo, to all the queer Gemini-Scorpio couples out there, keep on putting in that effort and working through those differences. You're like two pieces of a puzzle that might not seem like they fit, but when they do, it's a beautiful and unique queer masterpiece.\n",
        "overallscore": 60,
        "careerscore": 70,
        "intimatescore": 50,
        "mindsetscore": 65,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Gemini - Sagittarius",
        "combinationid": 27,
        "description": "Comparing a Gemini and a Sagittarius is like comparing fire and air. Both star signs are dynamic, quick-witted, and electric — just in slightly different ways. Gemini is an air sign, intellectual and communicative, while Sagittarius is a fire sign, passionate and adventurous.\n\nNow, Gemini and Sagittarius folks have a lot in common — they both love their freedom, they’re thirsty for knowledge, and they have a great sense of humor. That being said, they also both approach achieving those things in different ways. Gemini likes to explore ideas and concepts, while Sagittarius prefers to explore the world and all its cultures.\n\nThis dynamic can make for a super exciting and adventurous partnership. Gemini can keep Sagittarius on their toes with their intellectual wit, while Sagittarius can teach Gemini to embrace the spontaneous and unknown. \n\nSo, to all the queer Gemini-Sagittarius couples out there, keep on being the fire and air that you are — it's what makes your relationship so hot and cool at the same time.\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 100
    },
    {
        "possibleCombinations": "Gemini - Capricorn",
        "combinationid": 28,
        "description": "Gemini and Capricorn? Now that's an unlikely duo! But hey, never say never, right? Gemini is like the fun and flirty friend you bring to a party, always cracking jokes and chatting up a storm. Capricorn, on the other hand, is the responsible and practical one who's always got their sh*t together. But you know what they say, opposites attract! \n\nIf we had to compare this queer pairing to a place on Earth, it would definitely be Hollywood. Both Gemini and Capricorn are ambitious and driven, and all about chasing their dreams. It's a place where the glitz and glam meet the hustle and grind, just like this unlikely pairing. With some patience and compromise, they could make beautiful music together — like a catchy pop tune with a touch of country twang! Cue: Dolly Parton’s “Gonna Hurry (As Slow As I Can).”\n",
        "overallscore": 60,
        "careerscore": 75,
        "intimatescore": 50,
        "mindsetscore": 70,
        "interestsscore": 65
    },
    {
        "possibleCombinations": "Gemini - Aquarius",
        "combinationid": 29,
        "description": "Gemini and Aquarius are like the dynamic duo of the queer astrology world. Two air signs who share a love for intellectual banter, innovation, and freedom. Geminis bring their quick wit, adaptability, and insatiable curiosity to the table, while Aquarians bring their humanitarianism, eccentricity, and visionary thinking. It's like they're both superheroes fighting for a better world, but with different powers.\n\nIn a relationship, these two can ignite each other's passions and bring out the best in each other. They're like Betty and Veronica from Riverdale — different, but always pushing each other to be better. They can explore new ideas, travel to far-off lands, and dream up a world that's more accepting and diverse.\n\nIt's no surprise that their compatibility is off the charts — they're both highly intelligent and independent, yet able to work together as a team. Together, they're a force to be reckoned with, and they're not afraid to shake things up and challenge the status quo.\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Gemini - Pisces",
        "combinationid": 30,
        "description": "A Gemini and Pisces pairing is kind of like that outfit combination you thought wouldn’t work but actually ate. As air and water signs, they have different approaches to life, but can also complement each other in unexpected ways. Geminis are known for being quick-witted and curious, while Pisces are known for their intuition and empathy. It's like a classic rom-com where the two leads start off hating each other, but end up falling madly in love. Count me in!\n\nIn a relationship, Geminis bring their playful charm, adventurous spirit, and razor-sharp mind, while Pisces bring their emotional depth, sensitivity, and dreamy nature. Together, they can create a magical connection that is both stimulating and nurturing. They're like Abby and Harper from Happiest Season — two women who come from different worlds, but can't resist each other's charm.\n\nSo don't let your differences fool you — Gemini and Pisces can create a partnership that is both unconventional and beautiful. \n",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 95,
        "mindsetscore": 80,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Cancer - Leo",
        "combinationid": 31,
        "description": "A Cancer and Leo match is a whole lot like water and fire, babes. Both are intense and emotional, but in their own unique ways. Cancer is a water sign, nurturing and sensitive, while Leo is a fire sign, confident and fierce. While they do share some similarities, like loyalty and a love for attention, they differ when it comes to how they approach relationships. Cancer wants to care for their partner, while Leo wants to be the star of the show.\n\nThis dynamic can make for a wild and intense partnership. Cancer can teach Leo how to be more empathetic and in touch with their feelings, while Leo can inspire Cancer to be more confident and bold. This relationship is a lot like the lyrics of Lizzo's \"Truth Hurts.\" Cancer represents the line \"I just took a DNA test, turns out I'm 100% that b*tch,\" while Leo embodies the line \"I'm a star, I'm on top, somebody bring me some ham.\"\n",
        "overallscore": 70,
        "careerscore": 80,
        "intimatescore": 75,
        "mindsetscore": 65,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Cancer - Virgo",
        "combinationid": 32,
        "description": "Virgos and Cancers were made for each other. This duo’s vibes are 10/10 all around. As two tender, and brilliant signs, they share a mutual love for all things sweet and sentimental. Virgo, the earthy and practical babe, knows how to keep things in check, while Cancer, the watery and emotional one, knows how to keep the feels flowing.\n\nTogether, they make the perfect pair — Virgo's eye for detail balances out Cancer's heart-on-sleeve approach. It's like watching a magical drag queen duo on RuPaul's Drag Race — one serving fierce looks and the other serving emotional vulnerability. When they come together, it's pure magic.\n\nTheir emotional connection is strong and authentic, and their nurturing qualities make for a vulnerable and caring partnership. Whether they're cuddled up on the couch watching a movie or planning their next adventure, Virgo and Cancer know how to create a safe and loving space for each other.\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 90,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Cancer - Libra",
        "combinationid": 33,
        "description": "Cancer and Libra as star sign partners are a dynamic duo. While they may seem like an odd match at first, together they can create a unique blend of emotions and intellect. Cancer, the water sign, brings the tenderness and intuition, while Libra, the air sign, brings the wit and logic. Although they have different approaches to life, they both share a passion for balance and harmony.\n\nIn a relationship, Cancer brings their emotional depth, loyalty, and nurturing qualities, while Libra brings their intelligence, charm, and diplomacy. They may argue about decision-making, but who doesn’t! Their intimate life has a huge potential to be equally as passionate as it is fulfilling. They are like a pair of Mariah Carey songs — Cancer represents the soulful \"We Belong Together,\" while Libra embodies the iconic \"Obsessed.\"\n\nOverall, Cancer and Libra make a vibrant and queer match. They may be sweet and salty, but they blend together in a delicious way that leaves you wanting more.\n",
        "overallscore": 80,
        "careerscore": 70,
        "intimatescore": 90,
        "mindsetscore": 85,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Cancer - Scorpio",
        "combinationid": 34,
        "description": "Somebody grab me the tissue box while I cry over how beautifully tender a Cancer and Scorpio match can be. Both are water signs — emotional and intuitive, but with unique ways of approaching life. Cancer is nurturing and sensitive, while Scorpio is intense and passionate. Despite these differences, Cancer and Scorpio folks share a deep emotional connection and an uncanny understanding of each other's needs.\n\nTheir intimate life is off the charts, with their emotional connection so strong that it's almost as if they can read each other's minds. In terms of career, Cancer may find it challenging to keep up with Scorpio's intensity, but their shared emotional depth can lead to successful collaborations, and a head-over-heels kind of admiration for one another.\n\nTheir similarities and differences make for an intense and fulfilling partnership, akin to Miley Cyrus's iconic bop \"Adore You.\" Cancer represents the line \"When you say you love me, know I love you more,\" while Scorpio embodies the line \"I'm scared, so scared, but when you're near me, I feel like I'm standing with an army.\" I’m not crying, you are. \n\nTogether, they are a powerhouse of love and emotions that can conquer anything life throws at them.\n",
        "overallscore": 95,
        "careerscore": 80,
        "intimatescore": 100,
        "mindsetscore": 90,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Cancer - Sagittarius",
        "combinationid": 35,
        "description": "A Cancer and Sagittarius pairing might seem like an unlikely match, but that's what makes it so exciting! Cancer is all about emotions and stability, while Sagittarius is all about exploration and taking risks. They may not always understand each other's approach to life, but they share a deep desire for meaning and purpose. Cancer seeks this through emotional connections and security, while Sagittarius seeks it through new experiences and adventure.\n\nTogether, they can create a dynamic partnership that is both emotionally fulfilling and intellectually stimulating. Think of it as a queer version of \"Thelma & Louise,\" where Cancer represents the introspective Thelma, and Sagittarius embodies the adventurous Louise. They both bring their unique strengths to the table, and when they combine forces, they can conquer anything that comes their way.\n\nTheir partnership is like a vibrant rainbow, representing the beautiful blend of emotions and adventure. While Cancer may be hesitant to take risks, Sagittarius encourages them to step out of their comfort zone and embrace the unknown. And in return, Cancer brings a sense of tenderness and emotional depth to Sagittarius' wild spirit.\n",
        "overallscore": 65,
        "careerscore": 50,
        "intimatescore": 70,
        "mindsetscore": 75,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Cancer - Capricorn",
        "combinationid": 36,
        "description": "Alright, starshine, get ready for some good news! A Cancer and Capricorn match tends to be a vibrant, queer power duo, united in their desire for security, loyalty, and stability. As water and earth signs, they have a deep emotional connection and share a strong sense of practicality. However, they approach life in their unique ways. Cancers are emotional, intuitive, and nurturing, while Capricorns are driven, ambitious, and reserved. Their differences can create some sparks, but with empathy and communication, they can create a powerful team.\n\nIn a partnership, Cancers bring emotional depth, intuition, and a caring spirit, while Capricorns bring practicality, ambition, and a hardworking attitude. Cancers can help Capricorns connect with their feelings and prioritize their emotional well-being, while Capricorns can encourage Cancers to pursue their goals and ambitions. \n\nOverall, Cancer and Capricorn are a vibrant and charming match. Their compatibility in career, mindset, and interests is high, which means they can enjoy pursuing similar hobbies and working together towards their goals. With their powerful partnership, they can conquer anything life throws their way.\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Cancer - Aquarius",
        "combinationid": 37,
        "description": "Aquarius and Cancer may seem like an unlikely match, but let's be honest, who doesn't love a little bit of chaos and surprise in their life? I know I do! Plus, this duo is chaotic good, more than anything. Aquarius is all about living life on their own terms, while Cancer craves stability and a cozy home base. But together, they can create a dynamic partnership that's both adventurous and heartwarming.\n\nThink of them like a wild and carefree couple, like Thelma and Louise, but with a little more emotional depth. Aquarius brings their unconventional and cheeky attitude to the relationship, while Cancer adds their tender and caring touch. They may be different, but they both share a deep sense of compassion and a desire to make a positive impact on the world.\n\nIf we had to choose a place on Earth that embodies their relationship, it would have to be a queer-friendly beach in Ibiza. The island's laid-back vibe and stunning scenery represent Aquarius' free-spirited nature, while its warm and welcoming culture reflects Cancer's nurturing spirit. Together, they can soak up the sun, dance under the stars, and create memories that will last a lifetime.\n",
        "overallscore": 80,
        "careerscore": 70,
        "intimatescore": 75,
        "mindsetscore": 85,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Cancer - Pisces",
        "combinationid": 38,
        "description": "Cancer and Pisces are like two mermaids swimming in the same ocean, both guided by their emotions and intuition. They share a deep connection that is both nurturing and powerful, making for an enchanting partnership. While Cancer brings stability and practicality to the relationship, Pisces adds a touch of magic and imagination. Together, they create a balance that is both grounded and dreamy, like a queer fairy tale come to life.\n\nIf we were to compare this duo to a place on Earth with the same qualities, it would have to be a secret lagoon hidden in a mystical forest. The peaceful, serene waters represent their emotional connection, while the surrounding trees and flora symbolize their ability to support and grow with each other. It's a place where they can let their imaginations run wild and feel completely free to be themselves and live their best lives.\n",
        "overallscore": 90,
        "careerscore": 70,
        "intimatescore": 85,
        "mindsetscore": 80,
        "interestsscore": 95
    },
    {
        "possibleCombinations": "Leo - Virgo",
        "combinationid": 39,
        "description": "A Leo and Virgo a match is one that was made in queer heaven, baby! Leos are confident, passionate, and outgoing, while Virgos are practical, analytical, and reserved. But behind Virgo's seemingly calm exterior lies a fiery passion that can match Leo's flame. \n\nIn a partnership, Leo brings the drama, creativity, and fierce loyalty, while Virgo brings practicality, attention to detail, and a steady hand. They may seem like an unlikely duo, but together, they can make magic happen. They can challenge each other, support each other, and create a partnership that's as vibrant and dynamic as they are. What’s not to love about that?\n\n\n\n",
        "overallscore": 85,
        "careerscore": 9075,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Leo - Libra",
        "combinationid": 40,
        "description": "A Leo and Libra pairing is the ultimate party duo with their electric flair for fashion, art, and all things luxurious. Leo, the fire sign, brings the heat with their passionate and dramatic nature, while Libra, the air sign, charms everyone with their diplomatic and suave personality. They share a love for the finer things in life and have a contagious energy that attracts others to their circle. However, their differences can spark some playful challenges in their partnership. Leo can be a bit impulsive and a bit stuck in their ways, while Libra can be indecisive and a little too laid-back.\n\nIf we had to compare this potential queer couple to a place on Earth, we'd say they are like a vibrant, queer street festival in Rio de Janeiro. The colorful, extravagant floats symbolize Leo's passion and creativity, while the crowds dancing to the rhythm of the samba reflect Libra's ability to bring people together. It's a place where they can let loose and embrace their playful sides, while still indulging in the finer things in life.\n",
        "overallscore": 85,
        "careerscore": 75,
        "intimatescore": 90,
        "mindsetscore": 80,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Leo - Scorpio",
        "combinationid": 41,
        "description": "Alright, babes, let’s dive into this bold pairing. When we get into the nitty gritty, one thing is certain: A Leo and Scorpio match is fiery, magnetic, and intense. As fire and water signs, they share a love for drama, loyalty, and creativity, and they're not afraid to show it. However, their approaches to life are vastly different. Leos are extroverted, confident, and outgoing, while Scorpios are mysterious, intense, and introspective. These differences can lead to some heated discussions, but with a little compromise and a lot of passion, they can create a relationship that's both thrilling and fulfilling.\n\nIn a partnership, Leos bring charisma, passion, and a dramatic flair that can light up any room, while Scorpios bring depth, passion, and a touch of darkness that can add intrigue and mystery to any situation. This means that Leos can help Scorpios open up and let their hair down, while Scorpios can help Leos explore their inner depths and find their true desires. Imagine a couple like Blanca and Diablo from Pose — fiery and intense, but ultimately devoted to each other.\n\nOverall, Leo and Scorpio make a powerful match, but you better buckle up because it's going to be a wild ride.\n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 80,
        "mindsetscore": 75,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Leo - Sagittarius",
        "combinationid": 42,
        "description": "Leo and Sagittarius are two zodiac signs that share a very queer, very real desire for adventure and excitement. Both signs love to explore the world and experience new things with their community. They are both outgoing and confident, and enjoy being the center of attention (I mean, all is fair when you’re that magnetic). While Leo loves to be in charge and can be a bit of a diva, Sagittarius is more free-spirited and independent, embracing their identity to the fullest. These differences can sometimes lead to intense clashes, as Leo may feel that Sagittarius is too impulsive and Sagittarius may feel that Leo is too possessive.\n\nThat being said, their unique ways can make for a wild and thrilling relationship, full of passion and spontaneity that ignites the fire within them. After all, both of these star signs have a strong sense of self and share a passion for adventure and pleasure. And when they come together with an open mind, a passionate love is bound to outshine any differences. \n",
        "overallscore": 80,
        "careerscore": 75,
        "intimatescore": 85,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Leo - Capricorn",
        "combinationid": 43,
        "description": "A Leo and Capricon match is hot and sizzling. Both signs value success, loyalty, and hard work, despite their approaches to reaching those things being a bit different. Leos are vibrant, passionate, and confident, while Capricorns are steady, practical, and disciplined. Though these different ways of living can occassionally lead to some sweet and spicy clashes, they typically tend to balance each other out — bringing the best out in one another.\n\nIn a partnership, Leos bring creativity, enthusiasm, and an unapologetic sense of self, while Capricorns bring stability, practicality, and a no-BS kind of work ethic. This means that Leos can add a little rainbow to Capricorns' sometimes all-too-practical world, and Capricorns can help Leos prioritize their day-to-day tasks, and help bring their dreams to reality. While these two star signs definitely have different flavors, they complement each other perfectly and create a deliciously dynamic duo.\n",
        "overallscore": 70,
        "careerscore": 90,
        "intimatescore": 60,
        "mindsetscore": 75,
        "interestsscore": 65
    },
    {
        "possibleCombinations": "Leo - Aquarius",
        "combinationid": 44,
        "description": "Babes, if one thing is certain in this life it’s that a Leo and Aquarius match is bound to be unique and interesting. These two signs are both innovative and creative, always looking for new ways to express themselves and break free from convention. While Leo is known for their fiery and dramatic nature, Aquarius is cool and detached, valuing logic and reason over emotion.\n\nIn a partnership, Leo brings their charisma, passion, and creativity, while Aquarius brings their intellectualism, independence, and unique perspective. Although they may have different ways of approaching life, they can learn from each other and create a powerful partnership that is both exciting and stable.\n\nThey are like a colorful and bright parade, with Leo leading the charge with their flamboyance and Aquarius adding their unique and unconventional flair. Together, they make a dynamic and vibrant duo that stands out in any crowd.\n",
        "overallscore": 70,
        "careerscore": 75,
        "intimatescore": 65,
        "mindsetscore": 80,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Leo - Pisces",
        "combinationid": 45,
        "description": "Leo and Pisces make for a dreamy queer duo that's anything but ordinary. Leo's fiery passion and Pisces' watery intuition may seem like a mismatch, but they actually complement each other in a beautifully creative way. Both signs love to express themselves and embrace their dramatic sides, making them a perfect match for a life full of color, art, and adventure.\n\nIn a partnership, Leo can bring excitement, confidence, and a touch of glam, while Pisces can offer compassion, empathy, and a deeper emotional connection. Imagine a couple like Billy Porter and Adam Porter-Smith, who always shine on the red carpet but also share a deep, loving bond.\n\nTogether, they can explore the world and experience all its wonders with a sense of joy and creativity. They're like two colors that blend together to create a vibrant, unique shade that stands out in a crowd. Leo and Pisces may be unconventional, but their love is anything but ordinary.\n",
        "overallscore": 85,
        "careerscore": 70,
        "intimatescore": 90,
        "mindsetscore": 80,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Virgo - Libra",
        "combinationid": 46,
        "description": "Comparing Virgo and Libra as star sign partners is like comparing a cozy blanket and a warm hug. Both bring comfort, but in different ways. Virgo, the earth sign, is practical, detail-oriented, and grounded, while Libra, the air sign, is intellectual, harmonious, and seeks balance. Despite their differences, they share a deep appreciation for beauty, harmony, and justice.\n\nTheir partnership can be challenging at times, as Virgo can become overly critical and focused on the details, while Libra can become indecisive and overly concerned with aesthetics. However, when these two do find the right balance, their love is like a rainbow, vibrant and whimsical. \n\nTheir love is kind of like Abby and Harper from \"Happiest Season.\" Virgo, like Abby, is grounded and practical, while Libra, like Harper, brings a sense of balance and harmony. Together, they can help each other navigate the ups and downs of life with love, humor, and a deep appreciation for each other's strengths.\n",
        "overallscore": 70,
        "careerscore": 80,
        "intimatescore": 60,
        "mindsetscore": 70,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Virgo - Scorpio",
        "combinationid": 47,
        "description": "Virgo and Scorpio are two signs that can make queer sparks fly! They both have a deep sense of intuition and emotional intelligence that can create a strong connection. Virgos are practical, analytical, and love to organize things, while Scorpios are mysterious, intense, and full of passion. This dynamic can lead to a powerful partnership where both partners feel seen and understood.\n\nVirgo and Scorpio can be like two puzzle pieces that fit perfectly together. Virgo's attention to detail can balance Scorpio's intensity, while Scorpio's passion can awaken Virgo's sensual side. In a relationship, they can create a harmonious blend of practicality and emotionality that allows for both stability and deep connection.\n\nIf you're looking for a comparison, imagine Piper and Alex from Orange is the New Black — a partnership that starts off rocky but eventually finds a balance.",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Virgo - Sagittarius",
        "combinationid": 48,
        "description": "Virgo and Sagittarius make for an electrifying queer duo, with their distinct personalities and shared passion for adventure. Virgo is a grounded earth sign, with an eye for detail and a steady hand. Sagittarius is a wild fire sign, with a hunger for excitement and a thirst for knowledge. Despite their differences, they balance each other out beautifully, with Virgo providing a stable foundation and Sagittarius pushing Virgo out of their comfort zone.\n\nThis queer partnership is like a kaleidoscope, with every twist and turn revealing new colors and patterns. They bring a vibrancy to each other's lives that can't be matched. If this queer pair were a place on earth, it would have to be Tokyo — the bright lights and bustling energy of the city are balanced out by its peaceful temples and tranquil gardens. Together, they create a harmony that is both exciting and calming.\n",
        "overallscore": 60,
        "careerscore": 70,
        "intimatescore": 50,
        "mindsetscore": 65,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Virgo - Capricorn",
        "combinationid": 49,
        "description": "Comparing Virgo and Capricorn as star sign partners is like comparing two fabulous drag queens ready to sashay down the runway. Both are precise, fierce, and know how to work a room, but with different styles. Virgo is an earth sign, practical and analytical, while Capricorn is an earth sign, ambitious and driven. Virgo and Capricorn babes have a whole lot in common, such as a love for hard work, a sense of responsibility, and a deep appreciation of classic style. However, they do differ in their approach to achieving their goals. While Virgo likes to plan and analyze, Capricorn prefers to take action and make moves.\n\nThis dynamic can make for a powerful partnership, both in and out of the drag scene. Virgo can teach Capricorn how to finesse their performance and avoid burnout, while Capricorn can show Virgo how to take bold risks and leave a lasting impression on the audience. Together, they are like the vibrant streets of West Hollywood, full of energy and glamour.\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Virgo - Aquarius",
        "combinationid": 50,
        "description": "When it comes to Virgo and Aquarius, it's like mixing two bold and bright colors to create a unique and beautiful hue. As earth and air signs, they both possess a deep passion for intellectual exploration, independence, and critical thinking. While Virgos are practical, disciplined, and detail-oriented, Aquarians are quirky, imaginative, and unconventional. These differences may lead to disagreements, but with open-mindedness and communication, they can create an electric connection.\n\nIn a partnership, Virgos bring stability, dependability, and precision, while Aquarians bring innovation, spontaneity, and originality. This means that Virgos can ground Aquarians and help them stay on track, while Aquarians can inspire Virgos to step out of their comfort zone and explore new horizons. Imagine a match like Rosa Diaz and Jocelyn from Brooklyn Nine-Nine — two distinct personalities that complement each other perfectly, creating a union that's full of passion, excitement, and growth.\n",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 80,
        "mindsetscore": 95,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Virgo - Pisces",
        "combinationid": 51,
        "description": "A Virgo and Pisces match is a truly unique blend. Both signs are deeply intuitive, creative, and empathetic, but with different perspectives. Virgos are analytical, practical, and grounded, while Pisces are imaginative, emotional, and spiritual. This means that they can bring out the best in each other — Virgos can provide structure and organization to Pisces' artistic vision, while Pisces can inspire Virgos to tap into their emotions and embrace their inner artist.\n\nIn a partnership, Virgos bring their sharp minds, attention to detail, and a practical outlook, while Pisces bring their intuition, sensitivity, and spiritual depth. Together, they can create a magical partnership that's full of laughter, joy, and creativity. Imagine a match like Betty and Joan from Feud— different, but unforgettable.\n",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Libra - Scorpio",
        "combinationid": 52,
        "description": "Libra and Scorpio are bound to create a stunning emotional masterpiece. Libra, with their love for aesthetics, diplomacy, and harmony, is like a soft pastel hue, while Scorpio, with their passion, depth, and mystery, is like a bold, vibrant shade.\n\nIn a relationship, Libra can bring their balance and sense of fairness, while Scorpio adds depth and intensity. Libra can also teach Scorpio the art of diplomacy and compromise, while Scorpio can help Libra tap into their emotions and unleash their inner fire. Together, they create a partnership that is both complex and fascinating.\n\nThink of a match like Blanca and Elektra from Pose — two different personalities that complement each other perfectly, creating a fierce and unstoppable force.\n",
        "overallscore": 70,
        "careerscore": 60,
        "intimatescore": 75,
        "mindsetscore": 70,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Libra - Sagittarius",
        "combinationid": 53,
        "description": "Babes, a Libra and Sagittarius is bound to create a taste explosion. As air and fire signs, they share a passion for exploring, learning, and seeking new experiences. However, they approach life from different angles. Libras are charming, romantic, and diplomatic, while Sagittarians are adventurous, independent, and passionate. These differences can lead to challenges, but with open communication and empathy, they can create a beautifully harmonious partnership.\n\nIn a relationship, Libras bring balance, elegance, and refined taste, while Sagittarians bring spontaneity, enthusiasm, and a thirst for adventure. It's like the perfect blend of a fine wine and a wild fire, creating an intoxicating mix that leaves you wanting more. They can offer each other stability and support, while also igniting a spark that keeps the flames of their passion burning bright, thanks to their electric connection in their shared desire for exploration and growth.\n",
        "overallscore": 85,
        "careerscore": 75,
        "intimatescore": 90,
        "mindsetscore": 80,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Libra - Capricorn",
        "combinationid": 54,
        "description": "When it comes to Libra and Capricorn, it's like a cosmic dance of balance and complementarity. As air and earth signs, they both appreciate stability, practicality, and beauty. While Libras are social butterflies, bursting with creativity and idealism, Capricorns are typically more reserved and grounded, with a healthy dose of realism. But instead of letting these differences create a rift, they can choose to see them as an opportunity to learn from each other.\n\nIn a partnership, Libras bring their charm, diplomacy, and impeccable aesthetic sense, while Capricorns bring their ambition, laser-focus, and financial security. Libras can teach Capricorns how to let loose and appreciate the beauty in the world around them, while Capricorns can show Libras the value of hard work and planning. They can be like two halves of a whole, creating a harmony that is greater than the sum of its parts.\n",
        "overallscore": 80,
        "careerscore": 90,
        "intimatescore": 60,
        "mindsetscore": 70,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Libra - Aquarius",
        "combinationid": 55,
        "description": "Ah, the fabulous Libra and Aquarius pairing. These two zodiac signs are like the ultimate power couple, complimenting each other in the most vibrant ways. Both being air signs, they share a love for intellectual stimulation, socializing, and communication. They are also known for their creative streaks and independent attitudes. While Aquarius tends to be more eccentric, rebellious, and spontaneous, and Libra is known for their charm, diplomacy, and balance.\n\nIn a partnership, the similarities between Libra and Aquarius mean that they can communicate effortlessly, comprehend each other's need for freedom, and share a deep sense of justice and equality. They both have strong individualities, which means they are unlikely to become too dependent on each other. Their differences make for exciting learning opportunities, as they can challenge each other and bring new perspectives to the table.\n\nTheir unique styles, attitudes, and intellect make for a dynamic and tender partnership that is built on mutual growth, support, and love.\n",
        "overallscore": 95,
        "careerscore": 90,
        "intimatescore": 85,
        "mindsetscore": 95,
        "interestsscore": 100
    },
    {
        "possibleCombinations": "Libra - Pisces",
        "combinationid": 56,
        "description": "Libra and Pisces are like a burst of rainbow confetti, exploding with vibrant hues and a contagious energy that draws people in. As fluid and dynamic as the water and air they embody, these signs share a magnetic emotional connection that ignites passion and creativity. They are intuitive and empathetic, picking up on each other's moods and feelings without needing words.\n\nWhile Libras are known for their logical and analytical minds, they're also wild at heart, secretly yearning for more magic and enchantment in their lives. Pisces, on the other hand, thrive in the realm of dreams and imagination, dancing through life with a whimsical grace that inspires others. Together, they form an exquisite balance of logic and intuition, groundedness and fluidity.\n\nIn partnership, Libras offer a steady hand and a reassuring presence, helping to anchor Pisces and provide a sense of stability when the world gets too turbulent. Meanwhile, Pisces offer Libras a gateway to their deepest emotions and desires, coaxing them to embrace their intuition and surrender to the flow of life. This match made was made in queer heaven. Their compatibility is off the charts, with a synergy that radiates love, passion, and creative expression. Together, they are a force to be reckoned with, a glittering spectacle that lights up any room they enter.\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Scorpio - Sagittarius",
        "combinationid": 57,
        "description": "When it comes to queer love, Scorpio and Sagittarius are like two fierce femmes walking arm-in-arm down the colorful streets of a Pride parade. As a water sign, Scorpio brings a deep intensity and passionate energy to the table, while Sagittarius adds a fiery, free-spirited spark to the mix. That being said, Scorpio loves to explore the dark and mysterious corners of the world, while Sagittarius is all about chasing adventure and exploring new horizons.\n\nScorpio can teach Sagittarius about the power of emotional intimacy and connection, while Sagittarius can help Scorpio discover the joy of letting loose and embracing new experiences. Together, they are like a blend of the iconic lesbian bars of the West Village and the colorful murals of the Wynwood Walls in Miami.\n\nWhen Scorpio and Sagittarius come together, sparks fly, hearts race, and love blossoms in all its queer glory. It's a partnership that defies expectations, breaks down boundaries, creates a dazzling and unforgettable love story that can inspire us all to live life to the fullest.\n",
        "overallscore": 75,
        "careerscore": 65,
        "intimatescore": 80,
        "mindsetscore": 70,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Scorpio - Capricorn",
        "combinationid": 58,
        "description": "A Scorpio and Capricorn match is kind of like two femmes wrapped up in a cozy blanket on a crisp autumn day, sharing a cup of hot cocoa and whispering sweet nothings into each other's ears. These two earthy signs create a connection that is both intense and tender, filled with passion, depth, and a shared desire for success.\n\nAs water and earth signs, Scorpio and Capricorn bring different energies to the table. Scorpios are deeply emotional and intense, while Capricorns are practical and grounded. But rather than clashing, these differences create a beautiful balance in the relationship. Scorpios can bring their emotional intelligence and depth to the partnership, while Capricorns provide a stable and practical foundation.\n\nWhen Scorpio and Capricorn come together, they create a love that is passionate, tender, intense and comforting. It's a love that defies stereotypes and celebrates the beauty and diversity of the queer community. In short, this is a love story that will stand the test of time.\n",
        "overallscore": 90,
        "careerscore": 95,
        "intimatescore": 85,
        "mindsetscore": 80,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Scorpio - Aquarius",
        "combinationid": 59,
        "description": "When it comes to queer love, a Scorpio and Aquarius match tends to be intense and vibrant in its own way. The love that burns between these two star signs is fiery and cool, like a bold splash of color on a white canvas.\n\nAs water and air signs, Scorpio and Aquarius approach life differently. Scorpios are known for their passion and intuition, while Aquarians are innovative and analytical. But when these two come together, they create a dynamic partnership that defies expectations and celebrates individuality.\n\nTheir love can be both exciting and challenging! Scorpio can show Aquarius how to connect with their emotions on a deeper level, while Aquarius can teach Scorpio the power of truly taking a step back to reflect on those larger-than-life emotions.\n\nWhen Scorpio and Aquarius fall in love, they create a love that is both fierce and tender, passionate and cerebral. It's a love that celebrates the vibrancy and diversity of the queer community, embracing all the different colors and flavors that make it so beautiful.\n",
        "overallscore": 60,
        "careerscore": 80,
        "intimatescore": 50,
        "mindsetscore": 70,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Scorpio - Pisces",
        "combinationid": 60,
        "description": "A Scorpio-Pisces match is the ultimate queer power couple. Both signs have an emotional depth that can make their love feel like a work of art. Scorpios bring their intensity and magnetic energy to the partnership, while Pisces infuse their dreamy creativity and fluidity of emotion. While they may differ in their approaches to life, they have a deep understanding of each other that is unmatched.\n\nThis partnership is like a collaboration between Frida Kahlo and Tracey Emin — two artists coming together to create something beautiful and raw. Scorpio can help Pisces ground their emotions and give structure to their creativity, while Pisces can teach Scorpio to let go of control and embrace the beauty of the unknown. Together, they're like the rainbow flag — a symbol of love, acceptance, and unity.\n",
        "overallscore": 95,
        "careerscore": 70,
        "intimatescore": 90,
        "mindsetscore": 85,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Sagittarius - Capricorn",
        "combinationid": 61,
        "description": "Babes, I’m gonna be real with you: when it comes to Sagittarius and Capricorn as star sign partners, it's like a meeting of two different worlds. Which, hey, isn’t a bad thing! Sagittarius is a fire sign, wild and free, while Capricorn is an earth sign, grounded and reliable. As a potential couple, they could be described as the iconic lesbian anthem \"Girls Like Girls\" by Hayley Kiyoko, with Sagittarius as the bold and unapologetic chorus and Capricorn as the steady and supportive verses.\n\nWhile Sagittarius can bring passion and excitement to the relationship, Capricorn can provide a sense of practicality and security. However, their differences can also create challenges. Sagittarius may feel suffocated by Capricorn's need for structure, while Capricorn may struggle to keep up with Sagittarius' adventurous spirit. It takes a balance of compromise and understanding to make this partnership work, but it is oh-so-worth-it, like finding the perfect mix of colors in a vibrant mural.\n",
        "overallscore": 60,
        "careerscore": 90,
        "intimatescore": 65,
        "mindsetscore": 70,
        "interestsscore": 50
    },
    {
        "possibleCombinations": "Sagittarius - Aquarius",
        "combinationid": 62,
        "description": "Sagittarius and Aquarius, the queer darlings of the zodiac! These two signs share a love of adventure, independence, and intellectual stimulation, making them a dynamic and exciting pair. As fire and air signs, they are both spontaneous, enthusiastic, and full of energy. However, they differ in their approaches to life. Sagittarius is bold, daring, and loves exploring new places and ideas, while Aquarius is unconventional, analytical, and values their individuality. In a partnership, Sagittarius can bring the passion and excitement, while Aquarius can bring the creativity and uniqueness.\n\nPicture a match between Shane and Carmen from The L Word — Shane being the Sagittarius with her fiery personality and adventurous spirit, and Carmen being the Aquarius with her unconventional and artistic side. They might seem like an unlikely duo, but together, they make magic happen.\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Sagittarius - Pisces",
        "combinationid": 63,
        "description": "Pisces and Sagittarius as queer partners is a deliciously exciting dup. As water and fire signs, they may seem like opposites, but they share a love for adventure, optimism, and authenticity. Pisces are empathetic, intuitive, and creative, while Sagittarius are bold, adventurous, and straight-up honest. This partnership is like the perfect Pride parade — colorful, vibrant, and full of surprises.\n\nIn a relationship, Pisces bring their emotional depth, artistic talent, and nurturing spirit, while Sagittarius bring their passion, adventurous spirit, and a desire for excitement. Together, they can navigate the ups and downs of life with humor and resilience.\n",
        "overallscore": 85,
        "careerscore": 75,
        "intimatescore": 90,
        "mindsetscore": 80,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Capricorn - Aquarius",
        "combinationid": 64,
        "description": "Capricorn and Aquarius, two celestial beings that bring a unique flavor to the world of queer romance. Capricorn, with their practicality and determination, is the perfect match for Aquarius, whose innovative and imaginative spirit knows no bounds. Like a whimsical painting brought to life, these two zodiac signs can create a beautiful partnership that is both harmonious and dynamic.\n\nCapricorn brings a sense of stability and structure to the relationship, providing a solid foundation upon which Aquarius can build their dreams. At the same time, Aquarius sparks Capricorn's creative side, pushing them out of her comfort zone and into uncharted territory.\n",
        "overallscore": 80,
        "careerscore": 90,
        "intimatescore": 70,
        "mindsetscore": 75,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Capricorn - Pisces\nPisces - Capricorn",
        "combinationid": 65,
        "description": "A Capricorn and Pisces partnership is like the perfect blend of indie and pop — a little earthy, a little dreamy, and full of harmony. Capricorn is practical, ambitious, and goal-oriented, while Pisces is intuitive, emotional, and imaginative. Despite their differences, they both value stability, security, and emotional depth.\n\nIn a partnership, they balance each other out beautifully. Capricorn's practicality can help Pisces navigate the complexities of life, while Pisces' creativity can inspire Capricorn to dream big. Their dynamic is like the perfect hook in a catchy pop song — \"Don't go breaking my heart, I couldn't if I tried. Honey if I get restless, baby you're not that kind.\" With their passion and commitment, they’re a force to be reckoned with.\n",
        "overallscore": 90,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 85,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Aquarius - Pisces",
        "combinationid": 66,
        "description": "Aquarius and Pisces may seem different at first glance, but once they’re together — as two queer water signs — they sure do bring their own unique flavor to the mix. Aquarians are independent, innovative, and logical, while Pisceans are emotional, empathetic, and dreamy. It's like having a partner who completes you, with Aquarians providing the intellectual stimulation and Pisceans providing the emotional depth.\n\nIn a partnership, they complement each other perfectly. Aquarians bring their out-of-the-box thinking and Pisceans bring their heart-centered intuition. This means that Aquarians can help Pisceans find new ways to express themselves, while Pisceans can help Aquarians tap into their emotions and connect more deeply. They’re truly a queer power couple, with a dynamic and harmonious partnership.\n",
        "overallscore": 85,
        "careerscore": 80,
        "intimatescore": 90,
        "mindsetscore": 75,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Aries - Aries",
        "combinationid": 67,
        "description": "When two Aries come together as partners, sparks are bound to fly! These two passionate and fiery individuals are a perfect match in their enthusiasm for life, natural leadership abilities, and independent nature. Both are ruled by the planet Mars, which means they share an intense energy and a desire to pursue their dreams with unrelenting passion.\n\nHowever, as with any relationship, there are potential challenges to overcome. Aries individuals can be impulsive and quick to act, sometimes leading to hasty decisions or conflicts with their partner. Communication is also key, as their direct and blunt approach may not always be appreciated by their more diplomatic counterpart.\n\nBut with effort and understanding, the potential for an exhilarating and fulfilling partnership is limitless. Two Aries babes can create a powerful bond, fueled by their shared love of adventure and willingness to take risks. So if you're an Aries looking for a refreshing and exciting romance, look no further than another Aries!\n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 80,
        "mindsetscore": 75,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Taurus - Taurus",
        "combinationid": 68,
        "description": "Let’s be real: as a queer Taurus, you already know there's nothing more appealing than finding someone who shares your love of indulging in the finer things in life. The stability that comes with being an Earth sign can create a strong foundation for a long-lasting and fulfilling partnership.\n\nHowever, as two stubborn and determined individuals, conflicts can arise if two Tauruses are not willing to communicate and compromise. It's important for everyone to recognize their individual strengths and weaknesses and use them to complement each other. Finding someone who challenges us and brings excitement and novelty to our lives can be a game-changer.\n\nAt the end of the day, the shared values of loyalty, honesty, and determination that come with being a Taurus can make for a truly beautiful and fulfilling partnership. With open communication and a willingness to embrace new experiences, two Taureans can create a loving and exciting relationship that lasts a lifetime.\n",
        "overallscore": 85,
        "careerscore": 80,
        "intimatescore": 90,
        "mindsetscore": 75,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Gemini - Gemini",
        "combinationid": 69,
        "description": "When two Geminis come together as partners, it's like a whirlwind of magical queer energy and intellectual connection. They share a love of exploring new ideas and pushing boundaries, making their partnership dynamic and refreshing. They thrive on witty banter and engaging conversation, and are never afraid to challenge each other's perspectives.\n\nDespite their similarities, each Gemini partner brings their own unique flair to the relationship. One may be a social butterfly, always on the go and seeking adventure, while the other may be more introverted and introspective, preferring to ponder life's big questions. These differences can create a beautiful balance and keep the relationship exciting, as long as they communicate openly and honestly.\n\nTogether, Gemini-Gemini couples create a world of endless possibilities. They inspire each other to dream big, pursue their passions, and embrace their quirks and individuality. Their intellectual connection is unmatched, and their ability to communicate and connect on a deep level makes for a truly fulfilling partnership.\n",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 80,
        "mindsetscore": 85,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Cancer - Cancer",
        "combinationid": 70,
        "description": "When it comes to star sign partner compatibility, Cancers are a match made in the queerest of cosmos! These two are bound to have a lot in common, starting with their love for all things cozy and intimate. Both partners will feel at home with each other, bonding over their shared need for emotional depth and sensitivity. However, their differences lie in their approaches to expressing their emotions — while one may be more overtly affectionate, the other might need more space to process their feelings.\n\nBut fear not, for these differences can actually enhance their partnership! The Cancer-Cancer couple will balance each other out, with one partner bringing their fiery passion to the table and the other providing a calm, grounding presence. Plus, their shared love of domesticity means that they will thrive in creating a cozy, loving home together.\n\nOverall, the Cancer couple is a beautiful match that has the potential to last a lifetime. While they may have some minor differences to work through, their shared values and emotional depth will keep their relationship thriving. ",
        "overallscore": 95,
        "careerscore": 85,
        "intimatescore": 90,
        "mindsetscore": 90,
        "interestsscore": 90
    },
    {
        "possibleCombinations": "Leo - Leo",
        "combinationid": 71,
        "description": "Alright Leo babes, y'all are known for your fiery and passionate nature! This makes Leos a perfect match for another Leo. Both partners share a love for attention and luxury, and have a natural charisma that attracts others to them. They enjoy being in the spotlight, and together they can create a vibrant and exciting atmosphere. However, their competitive nature may lead to conflicts if they fail to recognize each other's strengths and weaknesses.\n\nThe similarities between two Leos in a relationship mean that they can understand each other's desires and motivations easily. They both appreciate grand gestures and very romantic queer displays, which can make their relationship feel like a never-ending honeymoon. However, their differences can also cause some tension. Leos can be stubborn and opinionated, and when two Leos butt heads, it can be explosive. They need to learn to communicate effectively and find a balance between compromise and standing their ground.\n\nIf Leos match was a place, it would be Las Vegas — glitzy, glamorous, and always buzzing with excitement. Their partnership would be filled with extravagant date nights and adventures, and they would always be the life of the party.",
        "overallscore": 90,
        "careerscore": 85,
        "intimatescore": 95,
        "mindsetscore": 80,
        "interestsscore": 85
    },
    {
        "possibleCombinations": "Virgo - Virgo",
        "combinationid": 72,
        "description": "When two Virgos come together, it's a match made in a very queer analytical heaven. Both partners are ruled by the planet Mercury, which means they share a love for organization, precision, and clear communication. They're also both Earth signs, meaning they're grounded, practical, and value stability in their lives.\n\nHowever, as much as they have in common, Virgos can also be incredibly different from one another. One partner may be more focused on logic and detail, while the other may be more intuitive and emotionally-driven. These differences can bring balance to the relationship, but it can also lead to conflicts if they're not careful.\n\nOverall, Virgo-Virgo partnerships tend to be stable and harmonious. They share a deep understanding of each other's quirks and tendencies, and they can work together to build a life that's structured, yet flexible enough to accommodate their individual growth. Their compatibility can be compared to the pristine and picture-perfect streets of Zurich, Switzerland.",
        "overallscore": 85,
        "careerscore": 90,
        "intimatescore": 75,
        "mindsetscore": 80,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Libra - Libra",
        "combinationid": 73,
        "description": "When two Libras come together, you better believe sparks will be flying all over the place! These two queer and romantic individuals share a deep love for aesthetics, balance, and harmony. They are ruled by Venus, the planet of love, beauty, and pleasure, which makes them extremely passionate and sensual lovers. Their charm, wit, and diplomacy are their greatest assets, and they know how to maintain a peaceful and harmonious environment.\n\nHowever, the two Libras can also be indecisive, procrastinating, and conflict-avoidant at times, which can lead to some challenges in their partnership. They both have a tendency to seek approval and validation from others, which can create some codependency issues. But, with their excellent communication skills and willingness to compromise, they can overcome any obstacles that come their way.\n\nIf these two Libras were a famous place, they would be the Palace of Versailles in France. It's giving elegance, it's giving refinement, it's giving beauty.",
        "overallscore": 95,
        "careerscore": 85,
        "intimatescore": 100,
        "mindsetscore": 90,
        "interestsscore": 80
    },
    {
        "possibleCombinations": "Scorpio - Scorpio",
        "combinationid": 74,
        "description": "Babe, I’m sure you already know that when it comes to Scorpio partners, things can get hot and heavy both in and out of the bedroom. With their passionate, intense energy and deep emotional connections, these two water signs make for a tantalizing match. They both value loyalty, honesty, and authenticity in their relationships, and they share a desire for profound emotional intimacy. But let's be real, with Scorpios, there's always a catch.\n\nWhile they may be incredibly hot, Scorpios can also be possessive and jealous, which could lead to some power struggles in the relationship. However, when two Scorpios come together, they can understand and respect each other's need for independence and intensity. In fact, they might find themselves in a game of one-upmanship to see who can be the most mysterious and alluring. Which, tbh, can be hot if everyone’s boundaries and feelings are being taken into consideration! \n\nIn terms of partnership, the Scorpio-Scorpio match is like a trip to the underground, queer parties of Berlin. This city is known for its edgy, unconventional vibe and its reputation as a hub for the adventurous and open-minded. Similarly, Scorpio partners are unafraid to explore the shadowy depths of their emotional and sexual desires, pushing each other to new levels of intimacy and excitement. So buckle up, it's going to be a wild ride.\n",
        "overallscore": 85,
        "careerscore": 80,
        "intimatescore": 95,
        "mindsetscore": 75,
        "interestsscore": 70
    },
    {
        "possibleCombinations": "Sagittarius - Sagittarius",
        "combinationid": 75,
        "description": "When two Sagittarians fall in love, it's like a perfect match in a world of queer chaos. These fiery, adventurous, and fun-loving individuals have so much in common, it's almost scary! Both partners share a love for freedom, exploration, and new experiences. They are both optimistic, enthusiastic, and have a passion for life. They also value honesty, authenticity, and are always up for a good philosophical discussion.\n\nHowever, despite their similarities, these archers are not identical. They have differences that complement each other in a partnership. Sagittarians are known for being straightforward, but one partner may be more expressive and emotional than the other. Also, one may be more impulsive and daring, while the other may be more calculated and strategic. These contrasting traits balance each other out and bring excitement and stability to the relationship.",
        "overallscore": 95,
        "careerscore": 85,
        "intimatescore": 90,
        "mindsetscore": 90,
        "interestsscore": 100
    },
    {
        "possibleCombinations": "Capricorn - Capricorn",
        "combinationid": 76,
        "description": "When it comes to Capricorn-Capricorn relationships, these two queer babes are a force to be reckoned with. Both partners are fiercely independent and driven, with a keen eye for success in their chosen fields. They share a love of tradition, but also have an adventurous streak that keeps things interesting.\n\nWhile their similarities can make for a strong foundation in a partnership, their differences can bring excitement and balance. One Capricorn may be more outgoing and social, while the other may be more introverted and introspective. This can lead to an interesting dynamic where the more extroverted Capricorn brings their partner out of their shell and the more introverted Capricorn helps their partner slow down and appreciate the quiet moments. With their shared determination and commitment, these two goats can conquer any obstacle that comes their way.\n",
        "overallscore": 90,
        "careerscore": 100,
        "intimatescore": 70,
        "mindsetscore": 80,
        "interestsscore": 60
    },
    {
        "possibleCombinations": "Aquarius - Aquarius",
        "combinationid": 77,
        "description": "When two Aquarians come together in a partnership, they're in for a wild ride. Both babes are known for their unique and quirky personalities, making for an unconventional pairing that's full of surprises. Despite being born under the same star sign, these two will likely have some differences that keep things interesting.\n\nBoth Aquarians are known for being analytical and logical, so they'll enjoy bouncing ideas off each other and engaging in stimulating conversations. They'll also appreciate each other's progressive values and passion for making the world a better place.\n\nThat being said, their individualistic tendencies may clash at times. Aquarians can be stubborn and opinionated, and both partners may have trouble compromising. Additionally, while they may be attracted to each other's uniqueness at first, they may find themselves craving more emotional depth and intimacy as the relationship progresses.",
        "overallscore": 80,
        "careerscore": 85,
        "intimatescore": 70,
        "mindsetscore": 90,
        "interestsscore": 75
    },
    {
        "possibleCombinations": "Pisces - Pisces",
        "combinationid": 78,
        "description": "When it comes to star sign partner compatibility, two Pisces partners can create an incredibly dreamy and romantic queer pairing. As the only zodiac sign represented by two fish swimming in opposite directions, Pisces are known for their emotional depth, creativity, and intuition. With two Pisces partners, there is an immediate understanding of each other's emotions and a natural ability to communicate without words. I'll have what they're having! Thanks!\n\nWhile Pisces partners share many similarities, such as a love for art, music, and nature, they can also be quite different. One partner may be more outgoing and extroverted, while the other is introspective and shy. However, these differences complement each other in partnership, creating a balance of yin and yang energies.\n\nImagine walking hand in hand with your Pisces partner through the colorful streets of Havana. The vibrant colors and romantic energy of this Cuban city are a perfect representation of the passionate and creative love that two Pisces can share.",
        "overallscore": 90,
        "careerscore": 75,
        "intimatescore": 100,
        "mindsetscore": 80,
        "interestsscore": 85
    }
]